Revit 2027 API
CompoundStructure.IsVerticallyHomogeneous Method
 Indicates whether this CompoundStructure represents a single set of parallel layers.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsVerticallyHomogeneous()
Public Function IsVerticallyHomogeneous As Boolean
public:
bool IsVerticallyHomogeneous()
member IsVerticallyHomogeneous : unit -> bool
Return Value
Boolean
 True if this CompoundStructure represents a series of parallel layers that stretch from bottom to top, false otherwise.
Remarks
 Differs from IsVerticallyCompound as a vertically compound structure might happen not to have any horizontal breaks. For that situation, both IsVerticallyCompound and this method will return true.
See Also
Reference
CompoundStructure Class
Autodesk.Revit.DB Namespace